

//******************************************************************************        
//name:         infrared.h        
//introduce:    红外发射    
//author:       lihao      
//changetime:   2017.06.02     
//email:        lihao198262@163.com    
//******************************************************************************


#ifndef __INFRARED_H
#define __INFRARED_H

#include "stm8s.h"

#define CHANNEL1

/*******************************************************************************
 * 名称: Haier_Infrared_Send
 * 功能: 红外发射 类型海尔
 * 形参: unsigned long data
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Haier_Infrared_Send(uint8_t data[], int len);

/*******************************************************************************
 * 名称: NEC_Infrared_Send
 * 功能: 红外发射 类型NEC
 * 形参: unsigned long data
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void NEC_Infrared_Send(unsigned long data);

/*******************************************************************************
 * 名称: Media_Infrared_Send
 * 功能: 红外发射
 * 形参: unsigned long data
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Media_Infrared_Send(unsigned long data);


/*******************************************************************************
 * 名称: Infrared_Send
 * 功能: 红外发射
 * 形参: unsigned long data
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Infrared_Send(unsigned long data);

/*******************************************************************************
 * 名称: Infrared_Init()
 * 功能: 初始化函数
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Infrared_Init(void);


/*******************************************************************************
 * 名称: delay_ms
 * 功能: 利用TIM1产生的1ms中断来计时
 * 形参: nms -> 计时值(ms)
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Delay_50Us( u32 nTime);
#endif


